export default {
  projections: {
    ОбслуживаниеE: {
      оператор: {
        __caption__: 'Оператор',
        фИО: {
          __caption__: 'ФИО'
        }
      },
      билетнаяКасса: {
        __caption__: 'Билетная касса',
        наименование: {
          __caption__: 'Наименование'
        },
        адрес: {
          __caption__: 'Адрес'
        }
      },
      датаПроверки: {
        __caption__: 'Дата проверки'
      },
      времяПроверки: {
        __caption__: 'Время проверки'
      },
      чековаяЛента: {
        __caption__: 'Чековая лента'
      },
      готовКРаботе: {
        __caption__: 'Готов к работе'
      }
    },
    ОбслуживаниеL: {
      чековаяЛента: {
        __caption__: 'Чековая лента'
      },
      датаПроверки: {
        __caption__: 'Дата проверки'
      },
      времяПроверки: {
        __caption__: 'Время проверки'
      },
      готовКРаботе: {
        __caption__: 'Готов к работе'
      },
      билетнаяКасса: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        },
        адрес: {
          __caption__: 'Адрес'
        }
      },
      оператор: {
        __caption__: 'ФИО',
        фИО: {
          __caption__: 'ФИО'
        }
      }
    }
  },
  validations: {
    времяПроверки: {
      __caption__: 'Время проверки'
    },
    готовКРаботе: {
      __caption__: 'Готов к работе'
    },
    датаПроверки: {
      __caption__: 'Дата проверки'
    },
    чековаяЛента: {
      __caption__: 'Чековая лента'
    },
    билетнаяКасса: {
      __caption__: 'Билетная касса'
    },
    оператор: {
      __caption__: 'Оператор'
    }
  }
};
