export default {
  projections: {
    ПокупкаБилетаE: {
      покупатель: {
        __caption__: 'Покупатель',
        банковскийСчет: {
          __caption__: 'Банковский счет'
        }
      },
      датаПоездки: {
        __caption__: 'Дата поездки'
      },
      место: {
        __caption__: 'Место'
      }
    }
  },
  validations: {
    датаПоездки: {
      __caption__: 'Дата поездки'
    },
    место: {
      __caption__: 'Место'
    },
    покупатель: {
      __caption__: 'Покупатель'
    },
    покупИлиВозвБ: {
      __caption__: 'покупИлиВозвБ'
    }
  }
};
