export default {
  projections: {
    ПокупИлиВозвБE: {
      дата: {
        __caption__: 'Дата'
      },
      пунктОтправ: {
        __caption__: 'Пункт отправления'
      },
      пунктНазнач: {
        __caption__: 'Пункт назначения'
      },
      билетнаяКасса: {
        __caption__: 'Место расчета',
        адрес: {
          __caption__: 'Адрес расчета'
        }
      },
      статус: {
        __caption__: 'Статус'
      },
      перевозчик1: {
        __caption__: 'Перевозчик'
      },
      покупкаБилета: {
        __caption__: 'Покупка билета',
        покупатель: {
          __caption__: 'Покупатель',
          банковскийСчет: {
            __caption__: 'Банковский счет'
          }
        },
        датаПоездки: {
          __caption__: 'Дата поездки'
        },
        место: {
          __caption__: 'Место'
        }
      },
      возвратБилета: {
        __caption__: 'Возврат билета',
        покупатель: {
          __caption__: 'Покупатель',
          банковскийСчет: {
            __caption__: 'Банковский счет'
          }
        },
        датаПокупки: {
          __caption__: 'Дата покупки'
        },
        причинаВозв: {
          __caption__: 'Причина Возврата'
        }
      }
    },
    ПокупИлиВозвБL: {
      дата: {
        __caption__: 'Дата'
      },
      пунктОтправ: {
        __caption__: 'Пункт отправления'
      },
      пунктНазнач: {
        __caption__: 'Пункт назначения'
      },
      билетнаяКасса: {
        __caption__: 'Место расчета',
        адрес: {
          __caption__: 'Адрес расчета'
        }
      },
      статус: {
        __caption__: 'Статус'
      },
      перевозчик1: {
        __caption__: ''
      },
      покупкаБилета: {
        __caption__: 'Покупка билета',
        покупатель: {
          __caption__: 'Покупатель',
          банковскийСчет: {
            __caption__: 'Банковский счет'
          }
        },
        датаПоездки: {
          __caption__: 'Дата поездки'
        },
        место: {
          __caption__: 'Место'
        }
      },
      возвратБилета: {
        __caption__: 'Возврат билета',
        покупатель: {
          __caption__: 'Покупатель',
          банковскийСчет: {
            __caption__: 'Банковский счет'
          }
        },
        датаПокупки: {
          __caption__: 'Дата покупки'
        },
        причинаВозв: {
          __caption__: 'Причина Возврата'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    пунктНазнач: {
      __caption__: 'Пункт назначения'
    },
    пунктОтправ: {
      __caption__: 'Пункт отправления'
    },
    статус: {
      __caption__: 'Статус'
    },
    билетнаяКасса: {
      __caption__: 'Место расчета'
    },
    перевозчик1: {
      __caption__: 'Перевозчик'
    },
    покупкаБилета: {
      __caption__: 'Покупка билета'
    },
    возвратБилета: {
      __caption__: 'Возврат билета'
    }
  }
};
